share/tutorials/basic/potential/cylinder/constant/polyMesh/boundary
// -*- c++ -*-
// mousse: CFD toolbox (v. 0.1.0)
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// ---

6
(
    down
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       3890;
    }
    right
    {
        type            patch;
        nFaces          30;
        startFace       3950;
    }
    up
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       3980;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       4040;
    }
    cylinder
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          40;
        startFace       4070;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       4110;
    }
)
// vim: set ft=openfoam sw=4 ts=4 sts=4 et:
