share/tutorials/basic/potential/cylinder/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    phiU
    {
        solver          GAMG;
        smoother        DIC;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;

        tolerance       1e-06;
        relTol          0.01;
    }

    p
    {
        $phiU;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}

// vim: set ft=foam et sw=4 ts=4 sts=4:
